# Pandas Assignments

In [2]:
# Libraries
import numpy as np
import pandas as pd
from datetime import datetime

### 1) Create a Datatime index containing all the weekdays days of year 2019 and assign a random number to each of them in a dataframe.

In [3]:
df = pd.DataFrame(np.random.randint(0,30,size=10),
                  columns = ["Random"],
                  index = pd.date_range(datetime.now(), periods=10))
df

                            Random
2020-02-20 07:00:07.020382      11
2020-02-21 07:00:07.020382      18
2020-02-22 07:00:07.020382       1
2020-02-23 07:00:07.020382      18
2020-02-24 07:00:07.020382      25
2020-02-25 07:00:07.020382       7
2020-02-26 07:00:07.020382       2
2020-02-27 07:00:07.020382      13
2020-02-28 07:00:07.020382      18
2020-02-29 07:00:07.020382      29

### 2) Given Pandas series , height = \[23,42,55\] and weight = \[71,32,48\] . Create a dataframe with height and weight as column names.

In [4]:
height = [23,42,55]
weight = [71,32,48]
df = pd.DataFrame(list(zip(height, weight)), columns = ["height", "weight"])
df

   height  weight
0      23      71
1      42      32
2      55      48

### 3) How to get the items of series A not present in series B .From ser1 remove items present in ser2.

ser1 = pd.Series(\[2, 3, 4, 5\])<br>
ser2 = pd.Series(\[5, 6, 7, 8\])

In [5]:
ser1 = pd.Series([2, 3, 4, 5])
ser2 = pd.Series([5, 6, 7, 8])
ser1[np.logical_not(ser1.isin(ser2))]

0    2
1    3
2    4
dtype: int64

## Questions on Titanic Dataset

In [6]:
titanic_df = pd.read_csv(r"F:\Projects\end_to_end_data_sets\titanic.csv")
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 4) Compute the minimum, 25th percentile, median, 75th, and maximum of age in titanic dataset

In [7]:
titanic_df.describe()['Age']

count    714.000000
mean      29.699118
std       14.526497
min        0.420000
25%       20.125000
50%       28.000000
75%       38.000000
max       80.000000
Name: Age, dtype: float64

In [8]:
titanic_df.median()['Age'] # Same as 50%

28.0

### 5) How to get frequency counts of unique items of a series? Calculate the frequency counts of ‘SibSp’ column in titanic Dataset

In [9]:
titanic_df['SibSp'].value_counts()

0    608
1    209
2     28
4     18
3     16
8      7
5      5
Name: SibSp, dtype: int64

### 6) Keep only top 2 most frequent values as it is and replace everything else as ‘Other’ in ‘Embarked’ column of titanic dataset

In [12]:
print(titanic_df['SibSp'].value_counts()[:2])

0    608
1    209
Name: SibSp, dtype: int64

### 7) Bin the price column in titanic data set into 5 equal groups and get counts of each bin

In [37]:
max(titanic_df['Fare'])

512.3292

In [38]:
min(titanic_df['Fare'])

0.0

In [57]:
titanic_df["Price"] = pd.qcut(titanic_df.Fare,q = 5,labels=['Very Low', 'Low', 'Medium', 'High', 'Very High'], precision=0)
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Price
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Very Low
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Very High
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Low
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Very High
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Low
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,Medium
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,High
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,High
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,High
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,Very Low

In [58]:
titanic_df["Price"].value_counts()

Low          184
High         180
Very Low     179
Very High    176
Medium       172
Name: Price, dtype: int64

### 8) Count the number of missing values in each column?

In [62]:
	
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
Price            0
dtype: int64

### 9) Get the row number of the 5th largest value in the Age column of titanic dataset?

### 10) Normalize all columns in a dataframe?

### 11) Get the indices of items of ser2 in ser1 as a list.

ser1 = pd.Series(\[10, 9, 6, 5, 3, 1, 12, 8, 13\])<br>
ser2 = pd.Series(\[1, 3, 10, 13\])

### 12) How to convert a series of date-strings to a timeseries?

\["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"\]

### 13) Get the day of month, week number, day of year and day of week from ser.

ser = pd.Series(\["01 Jan 2010", "02-02-2011", "20120303", "2013/04/04", "2014-05-05", "2015-06-06T12:20"\])

### 14) Compute the euclidean distance between series (points) p and q, without using a packaged formula.

p = pd.Series(\[1, 2, 3, 4, 5, 6, 7, 8, 9, 10\])<br>
q = pd.Series(\[10, 9, 8, 7, 6, 5, 4, 3, 2, 1\])

Desired Output 18.165

### 15) How to create a TimeSeries starting ‘2000-01-01’ and 10 weekends (saturdays/sundays)

### 16) Import every 50th row of BostonHousing dataset as a dataframe.